[
  {
    "id": "my-own-website",
    "slug": "my-own-website",
    "title": "My own Portfolio Website",
    "excerpt": "After working on many projects, little tools, websites and smart home features I decided to publish my own website where I share information about myself and my projects including this little blog for whenever I feel the need for sharing nonsense.",
    "content": "As the number of available domains is shrinking and I am having a little domain-buying-addiction I one day registered the domains `konrad2002.de` and `weiss-konrad.de` not knowing what to do with them. For several years I had them linked to my [GitHub profile](https://github.com/konrad2002). Now that I have published this website I will probably end up opening one of my domains with the goal to reach GitHub but end up here.\n\nA personal website is fun to make. But is that it? What are the benefits of throwing your portfolio into the world wide web? Well, I can't really tell yet and somehow I am also hoping that nobody will ever find this blog. I think the biggest enrichment of this page comes from two things:\n\n1. Thinking about all the [projects](/projects) that I have done so far made me find some long forgotten things and ignited a nostalgic deep-dive into old directories. It is nice to see what tools and page I have developed so far and how they improved throughout the years together with my skills.\n2. Writing my thoughts and takes into a blog is not just a nice way to spend longer train rides but also might prevent me from flooding friends with unnecessary information nobody asked about (Especially looking at the potential articles about train stuff). Most recently things happened so fast in my life that I do enjoy the chance to sit back once in a while and look back and recap what I have done so far.\n\nWhile this website not only encourages me to look back, the [now](/now) page has the same effect on the current tasks and goals.\n\nLately I updated my resumé from a word file that we were forced to create in my 9th year in school to a latex document. This comes with the great opportunity to use a shared data source for said latex file and the [cv page](/cv) on this website. I also hope that version-controlling my cv will finally get me out of the tons-of-outdated-cv-pdfs-hell that I was living in.\n\nLong story short, I currently am really enjoying writing articles like this and will hopefully keep doing so in the future. If you are actually an alive reader of this blog that is neither paid nor a family member, I can only apologise for all upcoming bad jokes and unnecessary topics.\n\nThis website will be available starting from January 19, 2026. If you are reading this, the website is already online.",
    "date": "2026-01-18",
    "readTime": "3 min read",
    "tags": ["Website", "Web Development", "Portfolio"],
    "published": true
  },
  {
    "id": "physikfasching-2026",
    "slug": "physikfasching-2026",
    "title": "Tanzende Physiker:innen",
    "excerpt": "",
    "content": "",
    "date": "2026-01-19",
    "readTime": "1 min read",
    "tags": ["Kultur", "German", "Report"],
    "published": false
  }
]
